## <u> Assignment 22 - 23rd Feb</u>

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
# importing pandas library
import pandas as pd

In [2]:
s1 = pd.Series([4, 8, 15, 16, 23, 42])
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
# list of first of numbers with 10 increment
my_lst = list(range(10,101,10))
print(my_lst)
print(type(my_lst))

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
<class 'list'>

In [4]:
# series for the my_lst 
s2 = pd.Series(my_lst)
print(s2)
print(type(s2))

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64
<class 'pandas.core.series.Series'>

#### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

|Name|Age|Gender|
| --- | --- | --- |
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|

In [5]:
# There are more than one method to create the above table

# Method 1: Creating from dictionary
d1 = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df1 = pd.DataFrame(d1)
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
# Method 2: Creating from list of tuples

cols = ['Name', 'Age', 'Gender']

tup = [('Alice', 25, 'Female'),
      ('Bob', 30, 'Male'),
      ('Claire', 27, 'Female')]

df2 = pd.DataFrame(tup, columns=cols)
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is 'DataFrame' in pandas and how is it different from pandas.series? Explain with an example.

A `DataFrame` in pandas is nothing but the tablular structure of the Dataset. It is combination of rows and columns with data. The column could be consist of different types.
It is similar kind of Excel Spreadsheet.

A `Series` is equivalent to list. It is one dimentional array of dataset. It contain data of any type. If you extract single column from dataframe, it is a Series.

In [7]:
# DataFrame example

mentors = {
    'name': ['Krish', 'Sudh', 'Karen'],
    'course': ['Statistics', 'Python', 'Java'],
    'email': ['krish@test.live', 'sudh@test.live', 'karen@test.live']
}

df3 = pd.DataFrame(mentors)
df3

    name      course            email
0  Krish  Statistics  krish@test.live
1   Sudh      Python   sudh@test.live
2  Karen        Java  karen@test.live

In [8]:
# let's see the type of df3
type(df3)  # it is pandas dataframe

pandas.core.frame.DataFrame

In [9]:
# Series examle : selecting one of the column 'course' from above dataframe df3

s3 = pd.Series(df3['course'])
print(s3)

0    Statistics
1        Python
2          Java
Name: course, dtype: object

In [10]:
# let's see the type of s3 
type(s3)  # it is pandas series

pandas.core.series.Series

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

*Below are some of the common functions which apply on dataframe to manipulate it.*

- df.head()
- df.columns
- df.dtypes
- df.isna()

Lets see them in example.

In [11]:
# creating a dataframe 
d2 = {
    'name': ['Alex', 'Robert', 'Kathleen', 'Roger', 'Neil', 'Braden', 'Julie', 'Jack'],
    'course': ['AI','ML','DL','DS','DA','CS','AC', 'ML'],
    'enrolled': [True, True, False, True, True, True, False, True],
    'grade': ['A+', 'B', None, 'B', 'A', 'B+', None, 'B'],
    'state': ['NC', 'GA', 'PA', 'TX', 'CA', 'MI', 'TX', 'NH'],
    'age': [20, 22, 20, 19, 25, 28, 23, 22]
}

df4 = pd.DataFrame(d2)
df4

       name course  enrolled grade state  age
0      Alex     AI      True    A+    NC   20
1    Robert     ML      True     B    GA   22
2  Kathleen     DL     False  None    PA   20
3     Roger     DS      True     B    TX   19
4      Neil     DA      True     A    CA   25
5    Braden     CS      True    B+    MI   28
6     Julie     AC     False  None    TX   23
7      Jack     ML      True     B    NH   22

* `df.head()`: To display the first five rows of the dataframe

In [12]:
df4.head()

       name course  enrolled grade state  age
0      Alex     AI      True    A+    NC   20
1    Robert     ML      True     B    GA   22
2  Kathleen     DL     False  None    PA   20
3     Roger     DS      True     B    TX   19
4      Neil     DA      True     A    CA   25

* `df.columns`: To get the name of columns of the dataframe

In [13]:
list(df4.columns)

['name', 'course', 'enrolled', 'grade', 'state', 'age']

* `df.dtypes`: To see the datatype of each columns

In [14]:
df4.dtypes

name        object
course      object
enrolled      bool
grade       object
state       object
age          int64
dtype: object

* `df.isna`: To find the missing data in a row for the column

In [15]:
df4.isna().sum()

name        0
course      0
enrolled    0
grade       2
state       0
age         0
dtype: int64

From the above result, we can see that there are 2 rows has missing value for `grade` column.

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

* `DataFrame` and `Series` are mutable that means you can modify/delete the object and its data after they created. If you do so, it will impact the original object with latest changes.

* On the other hand `Panel` object is immutable means they can not modified once they created. If you make any changes in that series object, it will create new object.

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
# first let's create some series objects

name = pd.Series(['Alex', 'Robert', 'Kathleen', 'Roger', 'Neil'])
course = pd.Series(['AI','ML','DL','DS','AI'])
grade =  pd.Series(['A+', 'B', None, 'B', 'A'])
state = pd.Series(['NC', 'GA', 'PA', 'TX', 'CA'])

# let create dataframe by using concat() method 

df5 = pd.concat([name, course], axis=1)
df5.columns = ['name', 'course']

In [17]:
df5

       name course
0      Alex     AI
1    Robert     ML
2  Kathleen     DL
3     Roger     DS
4      Neil     AI

In [18]:
# now let's add some more series in this dataframe by assigning series 
df5['grade'] = grade
df5['state'] = state

In [19]:
df5

       name course grade state
0      Alex     AI    A+    NC
1    Robert     ML     B    GA
2  Kathleen     DL  None    PA
3     Roger     DS     B    TX
4      Neil     AI     A    CA